app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."complete" = 'f'
---
  def index
    sleep 1
    @incomplete_tasks = Task.where(complete: false)

INSERT INTO "tasks" ("complete", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["complete", false], ["created_at", Tue, 13 Aug 2013 22:12:34 UTC +00:00], ["name", "Will this update?"], ["updated_at", Tue, 13 Aug 2013 22:12:34 UTC +00:00]]
---
  def create
    @task = Task.create!(params[:task])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "tasks" SET "complete" = 't', "updated_at" = '2013-08-13 22:58:36.086501' WHERE "tasks"."id" = 6
---
  def update
    @task = Task.find(params[:id])
    @task.update_attributes!(params[:task])

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]
---
  def destroy
    @task = Task.destroy(params[:id])